assignment3/app/controllers/entries_controller.rb

  def show
      @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @entry = Entry.new

    @entry.word = params[:entry][:word]
    @entry.definition = params[:entry][:definition]
    @entry.language = params[:entry][:language]

    if @entry.save
---
INSERT INTO "entries" ("word", "definition", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["word", "testetetete"], ["definition", "tetete"], ["language", "tetete"], ["created_at", "2018-04-15 19:38:26.466065"], ["updated_at", "2018-04-15 19:38:26.466065"]]

  def edit
    @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @entry = Entry.find(params[:id])

      @entry.word = params[:entry][:word]
      @entry.definition = params[:entry][:definition]
      @entry.language = params[:entry][:language]

    if @entry.save
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "entries" SET "word" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["word", "absolute music 1"], ["updated_at", "2018-04-15 19:37:40.159879"], ["id", 1]]

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 71]]